# GetItems Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PulldownButton..::..GetItems Method
PulldownButton Class See Also
---
Gets a copy of the collection of buttons assigned to the pulldown button.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<PushButton> GetItems()
```

Visual Basic
---
```text
Public Function GetItems As IList(Of PushButton)
```

Visual C++
---
```text
public:
IList<PushButton^>^ GetItems()
```

# See Also
PulldownButton Class
Autodesk.Revit.UI Namespace